semestr2/logika/01.03.2021-rachunek-nazw.org



* Rachunek nazw


** Nazwy

- Nazwa :: wyraz albo wyrażenie które nadaje sie na podmiot lub orzecznik w zdaniu A jest B

- nazwa kot domowy 
  + desygnat - ten konkretny kot
  + denotacja/zakres nazwy - zbiór wszystkich kotów domowych 
  + konotacja/treść językowa - zwierzę futerkowe, długi ogon, wąsy, itd
    - zbiór cech
      + konstytutywne - konieczne 
      + konsekutywne - wtórne, niekonieczne


** Rowniważność

- Nazwa równoważne :: nazwy o dokładnie tej samej denotacji (tym samym desygnacie?)
  + równoznaczne :: nazwy o tej samej konotacji ?
  + nie-równoznaczne :: nazwy o innych denotacjach, tym samym desygnacie

** Podział nazw  

*** Ze względu na budowę

- Nazwy proste :: nazwy jednowyrazowe
- Nazwy złożone :: nazwy wielowyrazowe

Nazwom złozonym można przyporządkować równoznaczne im nazwy proste

*** Ze względu na desygnat

**** Ze względu na ilość

- ogólne :: ma wiecej niz jeden desygnat
- jednostkowe :: ma dokładnie jeden desygnat
- puste :: nie ma desygnatów (np córka bezdzietnej matki, żonaty kawaler)

**** Ze względu na sposób istnienia/kategorię

- konkretne :: rzecz, bądź osoba, lub coś, co sobie jako osobę wyobrażamy.
  + osoba
    - istniejące :: profesor, wójt
    - nieistniejące :: elf, herkules
  + rzecz
    - istniejące :: stół, miasto
    - nieistniejące :: kwiat paproci

- abstrakcyjne :: własności, stany rzeczy, zdarzenia, zjawiska, relacje, odczucia, inne

**** Ze względu na strukturę

- zbiorowe :: desygnat nazwy ma budowę złozoną z wielu częsci prostych tworzących wzór 
- niezbiorowe :: 

**** Ze względu na rozpoznawalnosć

- ostre :: można jednoznacznie wyznaczyc jej zakres
- nieostre :: nie można jednoznacznie wyznaczyć jej zakresu (są niewyrażne)


*** Ze względu na znaczenie

**** Ze wględu na posiadanie znaczenia

- generalne :: nadaje się desygnatom ze wględu na pewne posiadane cechy
- indywidualne :: nadaje się wyłącznie na podmiot zdania (imiona własne)

**** Ze względu na rozpoznawalność znaczenia

- wyraźne :: można jednoznacznie opisać desygnat, wskazać treść językową
- niewyraźne :: nie można jednoznacznie opisać desygnatu


**** Ze względu na ilość posiadanych znaczeń

- jednoznaczne :: posiadają jedno znaczenie
- wieloznaczne :: posiadaja wiele znaczeń
