semestr2/logika/01.03.2021-rachunek-nazw.tex
% Created 2021-03-01 Mon 12:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{Rachunnek Nazw}
\hypersetup{
 pdfauthor={},
 pdftitle={Rachunnek Nazw},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Rachunek nazw}
\label{sec:orgef20363}


\subsection{Nazwy}
\label{sec:org261665b}

\begin{description}
\item[{Nazwa}] wyraz albo wyrażenie które nadaje sie na podmiot lub orzecznik w zdaniu A jest B

\item nazwa kot domowy 
\begin{itemize}
\item desygnat - ten konkretny kot
\item denotacja/zakres nazwy - zbiór wszystkich kotów domowych
\item konotacja/treść językowa - zwierzę futerkowe, długi ogon, wąsy, itd
\begin{itemize}
\item zbiór cech
\begin{itemize}
\item konstytutywne - konieczne
\item konsekutywne - wtórne, niekonieczne
\end{itemize}
\end{itemize}
\end{itemize}
\end{description}


\subsection{Rowniważność}
\label{sec:orgd9173e9}

\begin{description}
\item[{Nazwa równoważne}] nazwy o dokładnie tej samej denotacji (tym samym desygnacie?)
\begin{description}
\item[{równoznaczne}] nazwy o tej samej konotacji ?
\item[{nie-równoznaczne}] nazwy o innych denotacjach, tym samym desygnacie
\end{description}
\end{description}

\subsection{Podział nazw}
\label{sec:org426c5c1}

\subsubsection{Ze względu na budowę}
\label{sec:org0f72902}

\begin{description}
\item[{Nazwy proste}] nazwy jednowyrazowe
\item[{Nazwy złożone}] nazwy wielowyrazowe
\end{description}

Nazwom złozonym można przyporządkować równoznaczne im nazwy proste

\subsubsection{Ze względu na desygnat}
\label{sec:org7ca4f54}

\begin{enumerate}
\item Ze względu na ilość
\label{sec:org0d4ed11}

\begin{description}
\item[{ogólne}] ma wiecej niz jeden desygnat
\item[{jednostkowe}] ma dokładnie jeden desygnat
\item[{puste}] nie ma desygnatów (np córka bezdzietnej matki, żonaty kawaler)
\end{description}

\item Ze względu na sposób istnienia/kategorię
\label{sec:orgcda854f}

\begin{description}
\item[{konkretne}] rzecz, bądź osoba, lub coś, co sobie jako osobę wyobrażamy.
\begin{itemize}
\item osoba
\begin{description}
\item[{istniejące}] profesor, wójt
\item[{nieistniejące}] elf, herkules
\end{description}
\item rzecz
\begin{description}
\item[{istniejące}] stół, miasto
\item[{nieistniejące}] kwiat paproci
\end{description}
\end{itemize}

\item[{abstrakcyjne}] własności, stany rzeczy, zdarzenia, zjawiska, relacje, odczucia, inne
\end{description}

\item Ze względu na strukturę
\label{sec:orgd1fb066}

\begin{description}
\item[{zbiorowe}] desygnat nazwy ma budowę złozoną z wielu częsci prostych tworzących wzór
\item[{niezbiorowe}] 
\end{description}

\item Ze względu na rozpoznawalnosć
\label{sec:org88f56a2}

\begin{description}
\item[{ostre}] można jednoznacznie wyznaczyc jej zakres
\item[{nieostre}] nie można jednoznacznie wyznaczyć jej zakresu (są niewyrażne)
\end{description}
\end{enumerate}


\subsubsection{Ze względun na znaczenie}
\label{sec:org6754b16}

\begin{enumerate}
\item Ze wględu na posiadanie znaczenia
\label{sec:org1090f28}

\begin{description}
\item[{generalne}] nadaje się desygnatom ze wględu na pewne posiadane cechy
\item[{indywidualne}] nadaje się wyłącznie na podmiot zdania (imiona własne)
\end{description}

\item Ze względu na rozpoznawalność znaczenia
\label{sec:orgd8d37da}

\begin{description}
\item[{wyraźne}] można jednoznacznie opisać desygnat, wskazać treść językową
\item[{niewyraźne}] nie można jednoznacznie opisać desygnatu
\end{description}


\item Ze względu na ilość posiadanych znaczeń
\label{sec:org3614bdb}

\begin{description}
\item[{jednoznaczne}] posiadają jedno znaczenie
\item[{wieloznaczne}] posiadaja wiele znaczeń
\end{description}
\end{enumerate}
\end{document}
