semestr2/logika/01.03.2021-rachunek-nazw.md

# Table of Contents

1.  [Rachunek nazw](#org9f22671)
    1.  [Nazwy](#org36ea782)
    2.  [Rowniważność](#org1c0b8ea)
    3.  [Podział nazw](#org82a3135)
        1.  [Ze względu na budowę](#orgbfaada6)
        2.  [Ze względu na desygnat](#org3154e7a)
        3.  [Ze względu na znaczenie](#orgb9d63d6)


<a id="org9f22671"></a>

# Rachunek nazw


<a id="org36ea782"></a>

## Nazwy

-   **Nazwa:** wyraz albo wyrażenie które nadaje sie na podmiot lub orzecznik w zdaniu A jest B

-   nazwa kot domowy 
    -   desygnat - ten konkretny kot
    -   denotacja/zakres nazwy - zbiór wszystkich kotów domowych
    -   konotacja/treść językowa - zwierzę futerkowe, długi ogon, wąsy, itd
        -   zbiór cech
            -   konstytutywne - konieczne
            -   konsekutywne - wtórne, niekonieczne


<a id="org1c0b8ea"></a>

## Rowniważność

-   **Nazwa równoważne:** nazwy o dokładnie tej samej denotacji (tym samym desygnacie?)
    -   **równoznaczne:** nazwy o tej samej konotacji ?
    -   **nie-równoznaczne:** nazwy o innych denotacjach, tym samym desygnacie


<a id="org82a3135"></a>

## Podział nazw


<a id="orgbfaada6"></a>

### Ze względu na budowę

-   **Nazwy proste:** nazwy jednowyrazowe
-   **Nazwy złożone:** nazwy wielowyrazowe

Nazwom złozonym można przyporządkować równoznaczne im nazwy proste


<a id="org3154e7a"></a>

### Ze względu na desygnat

1.  Ze względu na ilość

    -   **ogólne:** ma wiecej niz jeden desygnat
    -   **jednostkowe:** ma dokładnie jeden desygnat
    -   **puste:** nie ma desygnatów (np córka bezdzietnej matki, żonaty kawaler)

2.  Ze względu na sposób istnienia/kategorię

    -   **konkretne:** rzecz, bądź osoba, lub coś, co sobie jako osobę wyobrażamy.
        -   osoba
            -   **istniejące:** profesor, wójt
            -   **nieistniejące:** elf, herkules
        -   rzecz
            -   **istniejące:** stół, miasto
            -   **nieistniejące:** kwiat paproci
    
    -   **abstrakcyjne:** własności, stany rzeczy, zdarzenia, zjawiska, relacje, odczucia, inne

3.  Ze względu na strukturę

    -   **zbiorowe:** desygnat nazwy ma budowę złozoną z wielu częsci prostych tworzących wzór
    -   **niezbiorowe:** 

4.  Ze względu na rozpoznawalnosć

    -   **ostre:** można jednoznacznie wyznaczyc jej zakres
    -   **nieostre:** nie można jednoznacznie wyznaczyć jej zakresu (są niewyrażne)


<a id="orgb9d63d6"></a>

### Ze względu na znaczenie

1.  Ze wględu na posiadanie znaczenia

    -   **generalne:** nadaje się desygnatom ze wględu na pewne posiadane cechy
    -   **indywidualne:** nadaje się wyłącznie na podmiot zdania (imiona własne)

2.  Ze względu na rozpoznawalność znaczenia

    -   **wyraźne:** można jednoznacznie opisać desygnat, wskazać treść językową
    -   **niewyraźne:** nie można jednoznacznie opisać desygnatu

3.  Ze względu na ilość posiadanych znaczeń

    -   **jednoznaczne:** posiadają jedno znaczenie
    -   **wieloznaczne:** posiadaja wiele znaczeń

